app/controllers/comments_controller.rb

  def create
    comment = Post.find(params[:post_id]).comments.create(comment_params)
---
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "abcd\r\n"], ["post_id", 3], ["created_at", "2015-04-29 20:10:04.248439"], ["updated_at", "2015-04-29 20:10:04.248439"]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]